LQM2015/stm32/Core/Src/audio_recorder.c
/**
 * @file audio_recorder.c
 * @brief Audio recorder implementation for I2S TDM PCM data recording
 * @date 2025-01-28
 */

/* Includes ------------------------------------------------------------------*/
#include "../Inc/audio_recorder.h"
#include "sai.h"
#include "fatfs.h"
#include "shell_log.h"
#include <string.h>
#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>
#include "cmsis_os.h"
#include "stm32h7xx_hal.h" // For SCB_InvalidateDCache_by_Addr

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
static AudioRecorder_t recorder = {0};
static uint16_t audio_buffer[AUDIO_BUFFER_SIZE / 2]; // 16-bit samples
static volatile bool buffer_ready = false;
static volatile bool half_buffer_ready = false;

static osSemaphoreId_t audio_data_sem = NULL;
static osThreadId_t audio_process_thread_id = NULL;

// External variables from fatfs
extern FATFS USERFatFS;
extern char USERPath[4];

/* Private function prototypes -----------------------------------------------*/
static void generate_filename(char* filename, size_t size);
static int write_audio_data(uint16_t* data, uint32_t size);
static void debug_sai_status(void);
static int check_sd_card_status(void);
static void audio_process_thread(void *argument);

/* Private functions ---------------------------------------------------------*/

/**
 * @brief Generate filename based on audio parameters
 * @param filename: Buffer to store filename
 * @param size: Buffer size
 */
static void generate_filename(char* filename, size_t size)
{
    // For now, use a simple counter-based naming
    static uint32_t file_counter = 0;
    file_counter++;
    
    snprintf(filename, size, "audio_%dch_%dbit_%dHz_%03lu.pcm", 
             AUDIO_CHANNELS, AUDIO_BIT_DEPTH, AUDIO_SAMPLE_RATE, file_counter);
}

/**
 * @brief Write audio data to SD card
 * @param data: Audio data buffer
 * @param size: Data size in bytes
 * @retval 0: Success, -1: Error
 */
static int write_audio_data(uint16_t* data, uint32_t size)
{
    UINT bytes_written;
    FRESULT res;
    
    if (!recorder.file_open) {
        SHELL_LOG_USER_ERROR("Cannot write data, file not open");
        return -1;
    }
    
    res = f_write(&recorder.file, data, size, &bytes_written);
    if (res != FR_OK || bytes_written != size) {
        SHELL_LOG_USER_ERROR("Write failed, FRESULT: %d, requested: %lu, written: %lu", 
               res, (unsigned long)size, (unsigned long)bytes_written);
        return -1;
    }
    
    recorder.bytes_written += bytes_written;
    
    // Sync file periodically to ensure data is written.
    // Increased the interval to reduce the frequency of potentially long, blocking f_sync calls,
    // which might interfere with time-sensitive peripherals like SAI.
    if (recorder.bytes_written > 0 && recorder.bytes_written % (AUDIO_BUFFER_SIZE * 100) == 0) {
        SHELL_LOG_USER_DEBUG("Syncing file, total written: %lu bytes", (unsigned long)recorder.bytes_written);
        f_sync(&recorder.file);
    }
    
    return 0;
}

/**
 * @brief Debug SAI and DMA status
 */
static void debug_sai_status(void)
{
    SHELL_LOG_USER_DEBUG("=== SAI Status Debug ===");
    SHELL_LOG_USER_DEBUG("SAI State: %d", HAL_SAI_GetState(&hsai_BlockA4));
    SHELL_LOG_USER_DEBUG("SAI Error Code: 0x%08lX", hsai_BlockA4.ErrorCode);
    
    // Check DMA status if available
    if (hsai_BlockA4.hdmarx != NULL) {
        SHELL_LOG_USER_DEBUG("DMA State: %d", HAL_DMA_GetState(hsai_BlockA4.hdmarx));
        SHELL_LOG_USER_DEBUG("DMA Error Code: 0x%08lX", hsai_BlockA4.hdmarx->ErrorCode);
    } else {
        SHELL_LOG_USER_WARNING("DMA handle is NULL");
    }
    
    SHELL_LOG_USER_DEBUG("========================");
}

/**
 * @brief Check SD card status and try to fix common issues
 * @retval 0: Success, -1: Error
 */
static int check_sd_card_status(void)
{
    FRESULT res;
    FATFS *fs;
    DWORD fre_clust;
    
    SHELL_LOG_USER_INFO("=== SD Card Status Check ===");
    
    // Try to get free space (this tests if SD card is accessible)
    res = f_getfree("0:", &fre_clust, &fs);
    if (res == FR_OK) {
        SHELL_LOG_USER_INFO("SD card is accessible");
        SHELL_LOG_USER_INFO("Free clusters: %lu", fre_clust);
        SHELL_LOG_USER_INFO("Cluster size: %lu bytes", fs->csize * 512);
        SHELL_LOG_USER_INFO("Free space: %lu MB", (fre_clust * fs->csize) / 2048);
        return 0;
    }
    
    SHELL_LOG_USER_WARNING("SD card not accessible, FRESULT: %d", res);
    
    // Try to fix by unmounting and remounting
    SHELL_LOG_USER_INFO("Attempting to fix SD card access...");
    
    // Unmount first
    f_mount(NULL, "0:", 0);
    HAL_Delay(200);
    
    // Try to mount again
    res = f_mount(&USERFatFS, "0:", 1);
    if (res != FR_OK) {
        SHELL_LOG_USER_ERROR("Failed to remount SD card, FRESULT: %d", res);
        return -1;
    }
    
    // Verify the mount worked
    HAL_Delay(100);
    res = f_getfree("0:", &fre_clust, &fs);
    if (res != FR_OK) {
        SHELL_LOG_USER_ERROR("SD card still not accessible after remount, FRESULT: %d", res);
        return -1;
    }
    
    SHELL_LOG_USER_INFO("SD card access restored successfully");
    SHELL_LOG_USER_INFO("Free clusters: %lu", fre_clust);
    return 0;
}

/* Exported functions --------------------------------------------------------*/

/**
 * @brief Initialize audio recorder
 * @retval 0: Success, -1: Error
 */
int audio_recorder_init(void)
{
    SHELL_LOG_USER_INFO("Initializing audio recorder...");
    
    // Initialize recorder structure
    recorder.channels = AUDIO_CHANNELS;
    recorder.bit_depth = AUDIO_BIT_DEPTH;
    recorder.sample_rate = AUDIO_SAMPLE_RATE;
    recorder.state = AUDIO_REC_IDLE;
    recorder.buffer_size = AUDIO_BUFFER_SIZE;
    recorder.bytes_written = 0;
    recorder.file_open = false;
    
    SHELL_LOG_USER_INFO("Config: %d channels, %d-bit, %d Hz, buffer size: %lu", 
           recorder.channels, recorder.bit_depth, recorder.sample_rate, (unsigned long)recorder.buffer_size);
    
